Revit 2027 API
ThermalAsset.Reflectivity Property
 The reflectivity of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Reflectivity { get; set; }
Public Property Reflectivity As Double
	Get
	Set
public:
property double Reflectivity {
	double get ();
	void set (double value);
}
member Reflectivity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for reflectivity is out of range
Remarks
 Values must be in the range 0 to 1.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace